# Calculate Mean, Meadian

In [259]:
import numpy as np
import pandas as pd
import csv

In [260]:
dt = pd.read_csv(r'C:\Users\Admin\Desktop\ML Intern\data.csv')

In [261]:
dt.shape

(60, 10)

In [262]:
dt.head()

,Date,Symbol,Series,Open Price,High Price,Low Price,Last Traded Price,Close Price,Total Traded Quantity,Turnover (in Lakhs)
0,13-Apr-20,LT,EQ,812.80,872.40,807.95,864.4,865.45,9462929,80158.97
1,09-Apr-20,LT,EQ,834.35,834.35,804.40,805.0,812.80,6410629,52338.49
2,08-Apr-20,LT,EQ,804.00,832.00,797.70,808.0,807.10,6151093,50037.53
3,07-Apr-20,LT,EQ,805.00,813.00,791.00,802.2,801.65,5769216,46404.57
4,03-Apr-20,LT,EQ,791.10,791.10,762.80,783.0,774.65,4268501,33009.75

In [263]:
dt.tail()

,Date,Symbol,Series,Open Price,High Price,Low Price,Last Traded Price,Close Price,Total Traded Quantity,Turnover (in Lakhs)
55,21-Jan-20,LT,EQ,1304.75,1313.90,1300.45,1302.1,1302.35,1361576,17786.66
56,20-Jan-20,LT,EQ,1313.95,1319.90,1306.50,1311.1,1309.60,2542477,33381.94
57,17-Jan-20,LT,EQ,1320.60,1325.95,1302.00,1304.0,1304.20,2941837,38585.23
58,16-Jan-20,LT,EQ,1327.70,1332.90,1317.40,1319.0,1319.30,1773135,23482.50
59,15-Jan-20,LT,EQ,1325.60,1336.15,1320.00,1323.5,1323.60,2127677,28229.96

In [264]:
dt.columns

Index(['Date', ' Symbol', ' Series', ' Open Price', ' High Price',
       ' Low Price', ' Last Traded Price ', ' Close Price',
       ' Total Traded Quantity', ' Turnover (in Lakhs)'],
      dtype='object')

In [265]:
dt = dt.rename(columns={' Open Price': 'Open Price'})
dt = dt.rename(columns={' Low Price': 'Low Price'})
dt = dt.rename(columns={' High Price': 'High Price'})
dt = dt.rename(columns={' Last Traded Price ': 'Last Traded Price'})

In [266]:
dt.columns

Index(['Date', ' Symbol', ' Series', 'Open Price', 'High Price', 'Low Price',
       'Last Traded Price', ' Close Price', ' Total Traded Quantity',
       ' Turnover (in Lakhs)'],
      dtype='object')

In [267]:
dt1 = dt[['Open Price', 'High Price', 'Low Price', 'Last Traded Price']]

In [268]:
dt1.head()

   Open Price  High Price  Low Price  Last Traded Price
0      812.80      872.40     807.95              864.4
1      834.35      834.35     804.40              805.0
2      804.00      832.00     797.70              808.0
3      805.00      813.00     791.00              802.2
4      791.10      791.10     762.80              783.0

In [269]:
dt1.describe()

        Open Price   High Price    Low Price  Last Traded Price
count    60.000000    60.000000    60.000000          60.000000
mean   1137.042500  1151.705000  1112.200000        1130.450000
std     215.752596   209.785502   226.634884         216.459653
min     697.200000   755.750000   661.000000         710.000000
25%     930.975000   953.562500   876.925000         900.100000
50%    1248.600000  1251.825000  1223.075000        1228.375000
75%    1305.312500  1314.025000  1292.750000        1298.625000
max    1375.950000  1383.700000  1360.450000        1370.000000

In [284]:
Mean = dt1.mean()
print(Mean)
print()
Median = dt1.median()
print(Median)
print()
#Mode = dt1.mode()[0]
#print(Mode)


#dt1.mode(axis='columns', numeric_only=True, dropna=True)

Open Price           1137.0425
High Price           1151.7050
Low Price            1112.2000
Last Traded Price    1130.4500
dtype: float64

Open Price           1248.600
High Price           1251.825
Low Price            1223.075
Last Traded Price    1228.375
dtype: float64

In [285]:
data = {'Mean':Mean, 'Median':Median}

In [286]:
df = pd.DataFrame(data, index =['Open Price', 'High Price', 'Low Price', 'Last Traded Price'])

In [287]:
df.to_csv (r'C:\Users\Admin\Desktop\ML Intern\data_ans.csv', index = True, header=True)

In [288]:
df

                        Mean    Median
Open Price         1137.0425  1248.600
High Price         1151.7050  1251.825
Low Price          1112.2000  1223.075
Last Traded Price  1130.4500  1228.375